var ex01 = '''
반갑습니다. 이 어플을 사용해 파이썬 퀴즈를 푸는 법을 알려드리겠습니다.
아래는 파이썬 코드를 사용한 퀴즈입니다.

변수 a와 b를 이용하여 a*b의 값을 출력하고자 합니다. ①에 들어갈 함수 이름은 무엇인가요?
''';

var code1 = '''
a = 10
b = 20
①(a * b)
''';

var ex02 = '''
코드를 한번 터치하면 클립보드에 복사됩니다. 복사된 코드는 파이썬 인터프리터에 붙여넣을 수 있습니다.

파이썬 인터프리터란, 파이썬 코드를 바로 실행하는 프로그램입니다. 이것이 없다면 코드를 실행시킬 수 없습니다.
제일 위에있는 <> 아이콘을 눌러보십시오.

아이콘을 눌렀으면, 온라인 인터프리터 페이지로 넘어갑니다. 아까 복사된 코드를 붙여넣고, 실행해보십시오.
''';

var code2 = '''
print(a * b)
>> 200
''';

var ex03 = '''
print 함수를 이용하면 다음과 같은 결과가 나옵니다.

정답을 보고싶으면 화면 하단의 '정답' 버튼을 누르시고, 한번 더 누르면 정답이 숨겨집니다.
''';

var answer1 = "정답 다시보기";

var answer2 = "답: ①: print \n해설: 콘솔에 출력을 하기 위해서는 print() 함수를 사용합니다.";