var ex01 = '''
객체

이번에는 객체에 대하여 알아보겠습니다.
객체는 존재하는 모든 것들을 의미합니다. 현실 세계는 개게로 이루어져 있고, 모든 사건들은 사물간의 상호작용을 통하여 발생하며, 객체의 속성을 이루는 데이터들 뿐만 아니라 그 데이터의 조작방법에 대한 내용도 포함됩니다. 또한 객체는 속성과 기능을 가지고 있는 것이 핵심입니다.


객체 지향 프로그래밍

Python은 객체 지향 언어입니다. 그렇다면 객체 지향이란 무엇일까요?
객체 개념을 다루는 것이 객체 지향입니다. 객체 지향 프로그래밍은 컴퓨터 프로그래밍 기법 중 하나로, 프로그램을 단순히 데이터와 처리 방법으로 나누는 것이 아니라, 프로그램을 수많은 '객체'라는 단위로 구분하고, 이 객체들의 상호작용하는 방식입니다. 각각의 객체는 메시지를 주고 받고, 데이터를 처리합니다.
자동차로 예를 들어 보겠습니다. 자동차를 '원동기를 장치하여 그 동력으로 바퀴를 굴려서 철길이나 가설된 선에 의하지 아니하고 땅 위를 움직이도록 만든 차'라는 사전적 의미만을 담는것이 아니라 '내가 탈 수 있고, 앞으로 뒤로 우 움직이는 행동을 할 수 있고 차 앞뒤에 있는 차량번호 정보와 디자인과 제조사, 모델명 정보'도 있습니다.
이러한 정보와 행위를 묶은 데이터를 하나의 자동차 객체로 볼 수 있습니다.

Python에서는 단순하게 'a'라는 문자를 표현하는 것으로 끝내는게 아니라, 'a'라는 문자 자체를 객체로 만들고 다양한 속성과 행동을 넣어뒀습니다. 이러한 객체들이 가진 속성중에 상태들은 'Value', 또는 'Attribute'라고 부릅니다. 또 객체가 가진 행동들은 'method'라고 부릅니다.

모든 것이 단순히 값이나, 하나의 정보가 아닌 객체로 취급하는 Python에 특성은 많은 장점을 가집니다.
''';