var ex01 = '''
반갑습니다. 이 어플을 사용해 파이썬 강좌를 효율적으로 사용하는법을 알려드리겠습니다.

아래는 파이썬 코드입니다.
''';

var code1 = '''
print('Hello world!')
''';

var ex02 = '''
코드를 한번 터치하면 클립보드에 복사됩니다. 복사된 코드는 파이썬 인터프리터에 붙여넣을 수 있습니다.

파이썬 인터프리터란, 파이썬 코드를 바로 실행하는 프로그램입니다. 이것이 없다면 코드를 실행시킬 수 없습니다.
제일 위에있는 <> 아이콘을 눌러보십시오.

아이콘을 눌렀으면, 온라인 인터프리터 페이지로 넘어갑니다. 아까 복사된 코드를 붙여넣고, 실행해보십시오.
''';

var code2 = '''
>> Hello, world!
''';

var ex03 = '''
위에있는 "Hello world!" 는 아까 복사한 코드를 실행시켰을 때의 결과입니다.
이렇게 복사한 코드를 실행시키시고, 파이썬 인터프리터로 본인의 코드를 테스트해보십시오.

한 페이지를 충분히 학습하셨으면 뒤로 돌아가서 다음 페이지를 학습하십시오.
''';